#include "calculator.h"

int Calculator::Add (int a, int b)
{
    return a + b;
}

int Calculator::Mul (double a, double b)
{
    return a * b + 0.5;
}

//Я знаю тебя много лет, но ты никогда не обращался ко мне за советом или помощью. Я не могу вспомнить, когда ты в последний раз приглашал меня в свой дом на чашку кофе, хотя моя жена — крёстная твоего единственного ребёнка. Будем сейчас откровенны: ты никогда не искал моей дружбы и ты боялся быть у меня в долгу.
//Я не хотел нажить неприятностей.
//Я понимаю. Ты нашёл в Америке рай: у тебя хорошо шёл бизнес, тебя защищала полиция и тебе не нужны были такие друзья, как я. А теперь ты приходишь и говоришь: Дон Корлеоне, мне нужна справедливость. Но ты не просишь с уважением, не предлагаешь дружбу, даже не думаешь обратиться ко мне — крёстный. Нет, ты приходишь ко мне в дом в день свадьбы моей дочери и просишь убивать за деньги.
//Вито Карлеоне 
// Мой отец сделал ему предложение, от которого он не смог отказаться. 
//Майкл Карлеоне 